{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "people trapped",
    "1": "injured people",
    "2": "fire damage",
    "3": "flood damage",
    "4": "infrastructure collapse",
    "5": "request for rescue",
    "6": "low priority situation"
  },
  "initializer_range": 0.02,
  "label2id": {
    "fire damage": 2,
    "flood damage": 3,
    "infrastructure collapse": 4,
    "injured people": 1,
    "low priority situation": 6,
    "people trapped": 0,
    "request for rescue": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.6.2",
  "use_cache": false,
  "vocab_size": 30522
}
